Revit 2027 API
ParameterTypeId.RebarHookLengthOverride Property
 "Override Hook Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarHookLengthOverride { get; }
Public Shared ReadOnly Property RebarHookLengthOverride As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarHookLengthOverride {
	ForgeTypeId^ get ();
}
static member RebarHookLengthOverride : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace